src/cf/Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
				<xr:Item>Catalog.НаборыЕдиницИзмерения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияПоКлассификатору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВладельца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_КоличествоПервичныхУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ЕдиницыИзмерения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	НастроитьВесИОбъем();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ИсточникКопирования = Параметры.ЗначениеКопирования;
		НастроитьВесИОбъем(Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.ПараметрыВыбора.Свойство("Владелец") Тогда
			ВладелецЭлемента = Параметры.ПараметрыВыбора.Владелец;
			
			Если ТипЗнч(ВладелецЭлемента) = Тип("СписокЗначений") Тогда
				Если ВладелецЭлемента.Количество() = 1 Тогда
					Объект.Владелец = ВладелецЭлемента[0].Значение;
				ИначеЕсли ВладелецЭлемента.Количество() > 0 Тогда
					Объект.Владелец = ВладелецЭлемента[1].Значение;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Параметры.СсылкаВладелец) Тогда
			Объект.Владелец = Параметры.СсылкаВладелец;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		ЕдиницаИзмеренияВладельца = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ЕдиницаИзмерения");
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПодсказкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("УказатьВесИОбъемДляЕдиницыТовара", ЗначениеЗаполнено(Вес) ИЛИ ЗначениеЗаполнено(Объем));
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Вес", Вес);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Объем", Объем);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	НастроитьВесИОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	
	Элементы.ГруппаВесИОбъем.ЗаголовокСвернутогоОтображения = ЗаголовокСвернутойГруппыВесИОбъем(Вес, Объем);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПриИзменении(Элемент)
	
	Элементы.ГруппаВесИОбъем.ЗаголовокСвернутогоОтображения = ЗаголовокСвернутойГруппыВесИОбъем(Вес, Объем);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияПоКлассификатору) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбновитьПодсказкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПоКлассификаторуПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Объект.Наименование = СокрЛП(Объект.ЕдиницаИзмеренияПоКлассификатору);
		
	КонецЕсли;
	
	ОбновитьПодсказкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	
	ОбновитьПодсказкиФормы();
	
	// + ор интеграция МДЛП.
	Если Объект.Коэффициент > 0 Тогда
		Объект.ор_КоличествоПервичныхУпаковок = Окр(1/Объект.Коэффициент, 0);
	Иначе
		Объект.ор_КоличествоПервичныхУпаковок = 0;
	КонецЕсли;
	// - ор интеграция МДЛП.
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Подключаемый_ор_КоличествоПервичныхУпаковок(Элемент)
	
	Если Объект.ор_КоличествоПервичныхУпаковок > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Пересчитать коэффициент?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Коэффициент = ОкруглитьКоэффициент(1 / Объект.ор_КоличествоПервичныхУпаковок);
	КонецЕсли;
	
	ОбновитьПодсказкиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИсторияИзменения(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураОтбора = Новый Структура("ВладелецЕдиницыИзмерения", Объект.Ссылка);
		ПараметрыОтбора = Новый Структура("Отбор", СтруктураОтбора);
		ОткрытьФорму("РегистрСведений.ИсторияИзмененийЕдиницИзмерения.ФормаСписка", ПараметрыОтбора, ЭтотОбъект, , , ,
			, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПодсказкиФормы()
	
	ТекстШаблона = НСтр("ru = '1 %1 = %2 %3'");
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияПоКлассификатору) Тогда
		
		ПредставлениеЕдиницыИзмерения = СокрЛП(Объект.ЕдиницаИзмеренияПоКлассификатору);
		
	ИначеЕсли НЕ ПустаяСтрока(Объект.Наименование) Тогда
		
		ПредставлениеЕдиницыИзмерения = СокрЛП(Объект.Наименование);
		
	Иначе
		
		ПредставлениеЕдиницыИзмерения = НСтр("ru = '<ед.изм.>'");
		
	КонецЕсли;
	
	Если Объект.Коэффициент >= 1 Тогда
		
		ЗаголовокДекорации = СтрШаблон(ТекстШаблона, ПредставлениеЕдиницыИзмерения, Объект.Коэффициент, СокрЛП(ЕдиницаИзмеренияВладельца))
			+ Символы.ПС + СтрШаблон(ТекстШаблона, СокрЛП(ЕдиницаИзмеренияВладельца), ОКР((1 / Объект.Коэффициент), 3), ПредставлениеЕдиницыИзмерения);
		
	Иначе
		
		ТекстШаблона = НСтр("ru = '1 %1 = %2 %3'");
		
		Если ЗначениеЗаполнено(Объект.Коэффициент) Тогда
			ЗаголовокДекорации = СтрШаблон(ТекстШаблона, СокрЛП(ПредставлениеЕдиницыИзмерения), ОКР(Объект.Коэффициент, 3), ЕдиницаИзмеренияВладельца)
				+ Символы.ПС + СтрШаблон(ТекстШаблона, СокрЛП(ЕдиницаИзмеренияВладельца), ОКР((1 / Объект.Коэффициент), 3), ПредставлениеЕдиницыИзмерения);
		Иначе
			ЗаголовокДекорации = "";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Коэффициент", "Подсказка", ЗаголовокДекорации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокСвернутойГруппыВесИОбъем(Знач Вес, Знач Объем)
	
	КомпонентыЗаголовка = Новый Массив;
	Если ЗначениеЗаполнено(Вес) Тогда
		КомпонентыЗаголовка.Добавить(СтрШаблон("Вес: %1 кг", Вес));
	КонецЕсли;
	Если ЗначениеЗаполнено(Объем) Тогда
		КомпонентыЗаголовка.Добавить(СтрШаблон("Объем: %1 м³", Объем));
	КонецЕсли;
	
	Возврат СтрСоединить(КомпонентыЗаголовка, ", ");
	
КонецФункции

&НаСервере
Процедура НастроитьВесИОбъем(ПоИсточникуКопирования = Ложь)
	
	Если ПоИсточникуКопирования Тогда
		ВладелецИсточника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникКопирования, "Владелец");
		Если ТипЗнч(ВладелецИсточника) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Элементы.ГруппаВесИОбъем.Видимость = Ложь;
			Возврат;
		КонецЕсли;
		ОтборНоменклатура = ВладелецИсточника;
		ОтборЕдиница = ИсточникКопирования;
	Иначе
		Если ТипЗнч(Объект.Владелец) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Элементы.ГруппаВесИОбъем.Видимость = Ложь;
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		ОтборНоменклатура = Объект.Владелец;
		ОтборЕдиница = Объект.Ссылка;
	КонецЕсли; 
	Элементы.ГруппаВесИОбъем.Видимость = Истина;
	
	МенеджерЗаписи = РегистрыСведений.ВесИОбъемЕдиницТоваров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = ОтборНоменклатура;
	МенеджерЗаписи.ЕдиницаИзмерения = ОтборЕдиница;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Вес = МенеджерЗаписи.Вес;
		Объем = МенеджерЗаписи.Объем;
		Элементы.ГруппаВесИОбъем.ЗаголовокСвернутогоОтображения = ЗаголовокСвернутойГруппыВесИОбъем(Вес, Объем);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОкруглитьКоэффициент(Число)
	
	Перем Результат;
	
	ТочностьОкругления   = 0.001;
	КоличествоИнтервалов = Число / ТочностьОкругления;
	
	// Вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервалов);
	
	Если КоличествоИнтервалов = КоличествоЦелыхИнтервалов Тогда
		// Числа поделились нацело. Округлять не нужно.
		Результат = Число;
	Иначе
		// При порядке округления "0.05" 0.371 должно округлится до 0.35.
		Результат = ТочностьОкругления * КоличествоЦелыхИнтервалов;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
